{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.14.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_15",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 512, 512, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_16"
            },
            "name": "input_16",
            "inbound_nodes": []
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_130",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_130",
            "inbound_nodes": [[["input_16", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_150",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_150",
            "inbound_nodes": [[["separable_conv2d_130", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_150",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_150",
            "inbound_nodes": [[["batch_normalization_150", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_131",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_131",
            "inbound_nodes": [[["activation_150", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_151",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_151",
            "inbound_nodes": [[["separable_conv2d_131", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_151",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_151",
            "inbound_nodes": [[["batch_normalization_151", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_30",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_30",
            "inbound_nodes": [[["activation_151", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_30",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_30",
            "inbound_nodes": [[["max_pooling2d_30", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_132",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_132",
            "inbound_nodes": [[["dropout_30", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_152",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_152",
            "inbound_nodes": [[["separable_conv2d_132", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_152",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_152",
            "inbound_nodes": [[["batch_normalization_152", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_133",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_133",
            "inbound_nodes": [[["activation_152", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_153",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_153",
            "inbound_nodes": [[["separable_conv2d_133", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_153",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_153",
            "inbound_nodes": [[["batch_normalization_153", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_31",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d_31",
            "inbound_nodes": [[["activation_153", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_31",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_31",
            "inbound_nodes": [[["max_pooling2d_31", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_134",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_134",
            "inbound_nodes": [[["dropout_31", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_154",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_154",
            "inbound_nodes": [[["separable_conv2d_134", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_154",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_154",
            "inbound_nodes": [[["batch_normalization_154", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_135",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_135",
            "inbound_nodes": [[["activation_154", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_155",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_155",
            "inbound_nodes": [[["separable_conv2d_135", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_155",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_155",
            "inbound_nodes": [[["batch_normalization_155", 0, 0, {}]]]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_30",
              "trainable": true,
              "dtype": "float32",
              "size": [2, 2],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_30",
            "inbound_nodes": [[["activation_155", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_30",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "concatenate_30",
            "inbound_nodes": [
              [
                ["up_sampling2d_30", 0, 0, {}],
                ["activation_153", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_136",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_136",
            "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_156",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_156",
            "inbound_nodes": [[["separable_conv2d_136", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_156",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_156",
            "inbound_nodes": [[["batch_normalization_156", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_137",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_137",
            "inbound_nodes": [[["activation_156", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_157",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_157",
            "inbound_nodes": [[["separable_conv2d_137", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_157",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_157",
            "inbound_nodes": [[["batch_normalization_157", 0, 0, {}]]]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_31",
              "trainable": true,
              "dtype": "float32",
              "size": [2, 2],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_31",
            "inbound_nodes": [[["activation_157", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_31",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "concatenate_31",
            "inbound_nodes": [
              [
                ["up_sampling2d_31", 0, 0, {}],
                ["activation_151", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_138",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_138",
            "inbound_nodes": [[["concatenate_31", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_158",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_158",
            "inbound_nodes": [[["separable_conv2d_138", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_158",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_158",
            "inbound_nodes": [[["batch_normalization_158", 0, 0, {}]]]
          },
          {
            "class_name": "SeparableConv2D",
            "config": {
              "name": "separable_conv2d_139",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "name": "separable_conv2d_139",
            "inbound_nodes": [[["activation_158", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_159",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_159",
            "inbound_nodes": [[["separable_conv2d_139", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_159",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "activation_159",
            "inbound_nodes": [[["batch_normalization_159", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_35",
              "trainable": true,
              "dtype": "float32",
              "filters": 1,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "pointwise_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_35",
            "inbound_nodes": [[["activation_159", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_16", 0, 0]],
        "output_layers": [["conv2d_35", 0, 0]]
      }
    },
    "training_config": {
      "loss": "loss",
      "metrics": [
        [
          {
            "class_name": "AUC",
            "config": {
              "name": "auc",
              "dtype": "float32",
              "num_thresholds": 200,
              "curve": "ROC",
              "summation_method": "interpolation",
              "multi_label": false,
              "num_labels": null,
              "label_weights": null,
              "from_logits": false
            }
          },
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "binary_accuracy"
            }
          },
          {
            "class_name": "Precision",
            "config": {
              "name": "precision",
              "dtype": "float32",
              "thresholds": null,
              "top_k": null,
              "class_id": null
            }
          },
          {
            "class_name": "Recall",
            "config": {
              "name": "recall",
              "dtype": "float32",
              "thresholds": null,
              "top_k": null,
              "class_id": null
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 4.0936538425739855e-5,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_150/gamma",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_150/beta",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_150/moving_mean",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_150/moving_variance",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_151/gamma",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_151/beta",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_151/moving_mean",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_151/moving_variance",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_152/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_152/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_152/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_152/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_153/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_153/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_153/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_153/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_154/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_154/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_154/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_154/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_155/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_155/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_155/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_155/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_156/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_156/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_156/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_156/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_157/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_157/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_157/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_157/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_158/gamma",
          "shape": [16],
          "dtype": "float32"
        },
        {
